import { useInView } from "react-intersection-observer";
import { Container } from "../../../components/Container/Container";
import "./Stages.scss";
import classNames from "classnames";

export const Stages = () => {
  const scrollToContact = () => {
    const form = document.querySelector(".contact");
    form.scrollIntoView({ behavior: "smooth" });
  };
  const observer = useInView({ threshold: 0.3 });
  return (
    <section className="section stages" ref={observer.ref}>
      <Container>
        <div className="stages__row">
          <div className={classNames("stages__column", { animate: observer.inView })} id="stages">
            <div className="stages__column__icon__container">
              <svg
                className="stages__column__icon"
                width="79"
                height="79"
                viewBox="0 0 79 79"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="39.5" cy="39.5" r="38.5" stroke="black" stroke-width="2" />
                <path
                  d="M20.473 51.679C18.0403 48.891 16.824 45.2147 16.824 40.65C16.824 36.0853 18.0403 32.4227 20.473 29.662C22.9057 26.874 25.926 25.48 29.534 25.48C33.142 25.48 36.1623 26.874 38.595 29.662C41.0277 32.4227 42.244 36.0853 42.244 40.65C42.244 45.2147 41.0277 48.891 38.595 51.679C36.1623 54.4397 33.142 55.82 29.534 55.82C25.926 55.82 22.9057 54.4397 20.473 51.679ZM22.318 31.343C20.432 33.5843 19.489 36.6867 19.489 40.65C19.489 44.6133 20.432 47.7293 22.318 49.998C24.2313 52.2393 26.6367 53.36 29.534 53.36C32.4313 53.36 34.823 52.2393 36.709 49.998C38.6223 47.7293 39.579 44.6133 39.579 40.65C39.579 36.6867 38.6223 33.5843 36.709 31.343C34.823 29.0743 32.4313 27.94 29.534 27.94C26.6367 27.94 24.2313 29.0743 22.318 31.343ZM46.9686 33.475V30.605L52.5036 26.3H54.9636V55H52.2986V29.375L46.9686 33.475Z"
                  fill="black"
                />
              </svg>
            </div>
            <div className="stages__column__title">Консультація та вибір ділянки</div>
            <div className="stages__column__text">
              Наші експерти зв’яжуться з вами, проведуть консультацію і допоможуть вибрати ділянку, яка відповідає вашим
              потребам та бюджету.
            </div>
          </div>
          <div className={classNames("stages__column", { animate: observer.inView })}>
            <div className="stages__column__icon__container">
              <svg
                className="stages__column__icon"
                width="79"
                height="79"
                viewBox="0 0 79 79"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="39.5" cy="39.5" r="38.5" stroke="black" stroke-width="2" />
                <path
                  d="M15.1278 51.679C12.6951 48.891 11.4788 45.2147 11.4788 40.65C11.4788 36.0853 12.6951 32.4227 15.1278 29.662C17.5605 26.874 20.5808 25.48 24.1888 25.48C27.7968 25.48 30.8171 26.874 33.2498 29.662C35.6825 32.4227 36.8988 36.0853 36.8988 40.65C36.8988 45.2147 35.6825 48.891 33.2498 51.679C30.8171 54.4397 27.7968 55.82 24.1888 55.82C20.5808 55.82 17.5605 54.4397 15.1278 51.679ZM16.9728 31.343C15.0868 33.5843 14.1438 36.6867 14.1438 40.65C14.1438 44.6133 15.0868 47.7293 16.9728 49.998C18.8861 52.2393 21.2915 53.36 24.1888 53.36C27.0861 53.36 29.4778 52.2393 31.3638 49.998C33.2771 47.7293 34.2338 44.6133 34.2338 40.65C34.2338 36.6867 33.2771 33.5843 31.3638 31.343C29.4778 29.0743 27.0861 27.94 24.1888 27.94C21.2915 27.94 18.8861 29.0743 16.9728 31.343ZM41.8284 55V52.54L50.6434 45.775C53.9234 43.2603 56.1784 41.2377 57.4084 39.707C58.6384 38.1763 59.2534 36.4407 59.2534 34.5C59.2534 32.614 58.5837 31.056 57.2444 29.826C55.9324 28.5687 54.2104 27.94 52.0784 27.94C49.5091 27.94 47.5821 29.006 46.2974 31.138C45.6961 32.122 45.2997 33.1743 45.1084 34.295H42.2384C42.4297 32.737 42.9354 31.2747 43.7554 29.908C45.5321 26.956 48.3064 25.48 52.0784 25.48C54.8937 25.48 57.2307 26.3683 59.0894 28.145C60.9754 29.8943 61.9184 32.0127 61.9184 34.5C61.9184 36.7687 61.1531 38.9007 59.6224 40.896C58.1191 42.864 55.8777 44.9687 52.8984 47.21L46.3384 52.171L45.9284 52.458V52.581L46.3384 52.54H61.9184V55H41.8284Z"
                  fill="black"
                />
              </svg>
            </div>
            <div className="stages__column__title">Огляд та перевірка ділянки</div>
            <div className="stages__column__text">
              Наші фахівці забезпечать огляд обраної ділянки, щоб ви могли оцінити її потенціал. Також буде проведена
              юридична перевірка документів, щоб забезпечити їхню чистоту та відповідність вимогам.
            </div>
          </div>
        </div>
        <div className="stages__row">
          <div className="stages__row__info">
            <div className={classNames("stages__row__info__title section__title", { animate: observer.inView })}>
              Етапи
              <br />
              роботи
            </div>
            <div className="stages__row__info__text">
              Весь процес роботи з нами зорієнтований на ваші потреби та задоволення вашого бажання мати власну земельну
              ділянку в Карпатах. Наша команда забезпечить вам професійну підтримку на кожному етапі, щоб зробити процес
              придбання ділянки максимально простим та зручним для вас.
            </div>
          </div>
          <div className="stages__row__inner">
            <div className={classNames("stages__column", { animate: observer.inView })}>
              <div className="stages__column__icon__container">
                <svg
                  className="stages__column__icon"
                  width="79"
                  height="79"
                  viewBox="0 0 79 79"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <circle cx="39.5" cy="39.5" r="38.5" stroke="black" stroke-width="2" />
                  <path
                    d="M14.2274 51.679C11.7947 48.891 10.5784 45.2147 10.5784 40.65C10.5784 36.0853 11.7947 32.4227 14.2274 29.662C16.6601 26.874 19.6804 25.48 23.2884 25.48C26.8964 25.48 29.9167 26.874 32.3494 29.662C34.7821 32.4227 35.9984 36.0853 35.9984 40.65C35.9984 45.2147 34.7821 48.891 32.3494 51.679C29.9167 54.4397 26.8964 55.82 23.2884 55.82C19.6804 55.82 16.6601 54.4397 14.2274 51.679ZM16.0724 31.343C14.1864 33.5843 13.2434 36.6867 13.2434 40.65C13.2434 44.6133 14.1864 47.7293 16.0724 49.998C17.9857 52.2393 20.3911 53.36 23.2884 53.36C26.1857 53.36 28.5774 52.2393 30.4634 49.998C32.3767 47.7293 33.3334 44.6133 33.3334 40.65C33.3334 36.6867 32.3767 33.5843 30.4634 31.343C28.5774 29.0743 26.1857 27.94 23.2884 27.94C20.3911 27.94 17.9857 29.0743 16.0724 31.343ZM40.723 47.62H43.388C43.6613 48.6587 44.1533 49.6153 44.864 50.49C46.4493 52.4033 48.6907 53.36 51.588 53.36C53.9113 53.36 55.7563 52.745 57.123 51.515C58.4897 50.2577 59.173 48.686 59.173 46.8C59.173 44.914 58.4897 43.356 57.123 42.126C55.7563 40.8687 53.9113 40.24 51.588 40.24H46.463V37.78L56.713 28.801V28.76H42.158V26.3H60.403V28.76L50.563 37.37L50.153 37.698V37.78H51.588C54.5947 37.78 57.0547 38.6547 58.968 40.404C60.8813 42.1533 61.838 44.2853 61.838 46.8C61.838 49.3147 60.8813 51.4467 58.968 53.196C57.0547 54.9453 54.5947 55.82 51.588 55.82C47.6247 55.82 44.6317 54.4533 42.609 51.72C41.7343 50.572 41.1057 49.2053 40.723 47.62Z"
                    fill="black"
                  />
                </svg>
              </div>
              <div className="stages__column__title">Укладання договору</div>
              <div className="stages__column__text">
                Після вибору ділянки та її перевірки, ми підготуємо договір купівлі-продажу, де будуть відображені всі
                умови та деталі що до землі яку Ви обрали.
              </div>
            </div>
            <div className={classNames("stages__column", { animate: observer.inView })}>
              <div className="stages__column__icon__container">
                <svg
                  className="stages__column__icon"
                  width="79"
                  height="79"
                  viewBox="0 0 79 79"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <circle cx="39.5" cy="39.5" r="38.5" stroke="black" stroke-width="2" />
                  <path
                    d="M14.3275 51.679C11.8948 48.891 10.6785 45.2147 10.6785 40.65C10.6785 36.0853 11.8948 32.4227 14.3275 29.662C16.7602 26.874 19.7805 25.48 23.3885 25.48C26.9965 25.48 30.0168 26.874 32.4495 29.662C34.8822 32.4227 36.0985 36.0853 36.0985 40.65C36.0985 45.2147 34.8822 48.891 32.4495 51.679C30.0168 54.4397 26.9965 55.82 23.3885 55.82C19.7805 55.82 16.7602 54.4397 14.3275 51.679ZM16.1725 31.343C14.2865 33.5843 13.3435 36.6867 13.3435 40.65C13.3435 44.6133 14.2865 47.7293 16.1725 49.998C18.0858 52.2393 20.4912 53.36 23.3885 53.36C26.2858 53.36 28.6775 52.2393 30.5635 49.998C32.4768 47.7293 33.4335 44.6133 33.4335 40.65C33.4335 36.6867 32.4768 33.5843 30.5635 31.343C28.6775 29.0743 26.2858 27.94 23.3885 27.94C20.4912 27.94 18.0858 29.0743 16.1725 31.343ZM41.0281 48.44V45.98L51.2781 26.3H54.1481L43.8981 45.98H56.4031V38.19H56.6081H59.0681V45.98H63.3731V48.44H59.0681V55H56.4031V48.44H41.0281Z"
                    fill="black"
                  />
                </svg>
              </div>
              <div className="stages__column__title">Оформлення документів</div>
              <div className="stages__column__text">
                Наша юридична команда допоможе вам з оформленням необхідних документів для передачі прав власності на
                землю, забезпечуючи юридичну чистоту та безпеку угоди.
              </div>
            </div>
          </div>
        </div>
        <div className="stages__row">
          <div className={classNames("stages__column", { animate: observer.inView })}>
            <div className="stages__column__icon__container">
              <svg
                className="stages__column__icon"
                width="79"
                height="79"
                viewBox="0 0 79 79"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="39.5" cy="39.5" r="38.5" stroke="black" stroke-width="2" />
                <path
                  d="M14.2069 51.679C11.7742 48.891 10.5579 45.2147 10.5579 40.65C10.5579 36.0853 11.7742 32.4227 14.2069 29.662C16.6396 26.874 19.6599 25.48 23.2679 25.48C26.8759 25.48 29.8962 26.874 32.3289 29.662C34.7616 32.4227 35.9779 36.0853 35.9779 40.65C35.9779 45.2147 34.7616 48.891 32.3289 51.679C29.8962 54.4397 26.8759 55.82 23.2679 55.82C19.6599 55.82 16.6396 54.4397 14.2069 51.679ZM16.0519 31.343C14.1659 33.5843 13.2229 36.6867 13.2229 40.65C13.2229 44.6133 14.1659 47.7293 16.0519 49.998C17.9652 52.2393 20.3706 53.36 23.2679 53.36C26.1652 53.36 28.5569 52.2393 30.4429 49.998C32.3562 47.7293 33.3129 44.6133 33.3129 40.65C33.3129 36.6867 32.3562 33.5843 30.4429 31.343C28.5569 29.0743 26.1652 27.94 23.2679 27.94C20.3706 27.94 17.9652 29.0743 16.0519 31.343ZM42.1375 47.62H44.8025C45.0758 48.604 45.5815 49.5607 46.3195 50.49C47.9048 52.4033 50.0642 53.36 52.7975 53.36C55.0115 53.36 56.8292 52.663 58.2505 51.269C59.6718 49.875 60.3825 48.112 60.3825 45.98C60.3825 43.848 59.6718 42.085 58.2505 40.691C56.8292 39.297 55.0115 38.6 52.7975 38.6C50.7475 38.6 48.9708 39.1877 47.4675 40.363C46.7842 40.8277 46.2375 41.4017 45.8275 42.085H43.3675L44.5975 26.3H61.2025V28.76H46.8525L46.0325 38.559V38.6C46.5245 38.108 47.0848 37.698 47.7135 37.37C49.1895 36.55 50.8842 36.14 52.7975 36.14C55.7495 36.14 58.1958 37.083 60.1365 38.969C62.0772 40.855 63.0475 43.192 63.0475 45.98C63.0475 48.768 62.0772 51.105 60.1365 52.991C58.1958 54.877 55.7495 55.82 52.7975 55.82C48.9708 55.82 46.0598 54.4533 44.0645 51.72C43.1625 50.5173 42.5202 49.1507 42.1375 47.62Z"
                  fill="black"
                />
              </svg>
            </div>
            <div className="stages__column__title">Проведення оплати</div>
            <div className="stages__column__text">
              Ми забезпечимо прозорий та безпечний процес оплати, де ви зможете зручно здійснити оплату за обрану
              ділянку.
            </div>
          </div>
          <div className={classNames("stages__column", { animate: observer.inView })}>
            <div className="stages__column__icon__container">
              <svg
                className="stages__column__icon"
                width="79"
                height="79"
                viewBox="0 0 79 79"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <circle cx="39.5" cy="39.5" r="38.5" stroke="black" stroke-width="2" />
                <path
                  d="M14.4071 51.679C11.9744 48.891 10.7581 45.2147 10.7581 40.65C10.7581 36.0853 11.9744 32.4227 14.4071 29.662C16.8398 26.874 19.8601 25.48 23.4681 25.48C27.0761 25.48 30.0964 26.874 32.5291 29.662C34.9618 32.4227 36.1781 36.0853 36.1781 40.65C36.1781 45.2147 34.9618 48.891 32.5291 51.679C30.0964 54.4397 27.0761 55.82 23.4681 55.82C19.8601 55.82 16.8398 54.4397 14.4071 51.679ZM16.2521 31.343C14.3661 33.5843 13.4231 36.6867 13.4231 40.65C13.4231 44.6133 14.3661 47.7293 16.2521 49.998C18.1654 52.2393 20.5708 53.36 23.4681 53.36C26.3654 53.36 28.7571 52.2393 30.6431 49.998C32.5564 47.7293 33.5131 44.6133 33.5131 40.65C33.5131 36.6867 32.5564 33.5843 30.6431 31.343C28.7571 29.0743 26.3654 27.94 23.4681 27.94C20.5708 27.94 18.1654 29.0743 16.2521 31.343ZM41.5177 45.775C41.5177 45.3103 41.5314 44.873 41.5587 44.463C41.6134 44.053 41.709 43.6293 41.8457 43.192C41.9824 42.7547 42.078 42.3993 42.1327 42.126C42.1874 41.8253 42.3514 41.4427 42.6247 40.978C42.9254 40.5133 43.1167 40.199 43.1987 40.035C43.2807 39.8437 43.513 39.4883 43.8957 38.969C44.3057 38.4223 44.5517 38.0943 44.6337 37.985C44.7157 37.8757 45.0164 37.5067 45.5357 36.878C46.055 36.222 46.3557 35.8393 46.4377 35.73L53.8177 26.3H56.8927L49.3077 35.894L49.1437 36.099L49.1027 36.14L49.9227 35.935C50.606 35.7983 51.4944 35.73 52.5877 35.73C55.4577 35.73 57.8767 36.714 59.8447 38.682C61.84 40.6227 62.8377 42.987 62.8377 45.775C62.8377 48.563 61.8127 50.941 59.7627 52.909C57.74 54.8497 55.2117 55.82 52.1777 55.82C49.1437 55.82 46.6017 54.8497 44.5517 52.909C42.529 50.941 41.5177 48.563 41.5177 45.775ZM46.4377 40.363C44.9344 41.8117 44.1827 43.6157 44.1827 45.775C44.1827 47.9343 44.9344 49.7383 46.4377 51.187C47.941 52.6357 49.8544 53.36 52.1777 53.36C54.501 53.36 56.4144 52.6357 57.9177 51.187C59.421 49.7383 60.1727 47.9343 60.1727 45.775C60.1727 43.6157 59.421 41.8117 57.9177 40.363C56.4144 38.9143 54.501 38.19 52.1777 38.19C49.8544 38.19 47.941 38.9143 46.4377 40.363Z"
                  fill="black"
                />
              </svg>
            </div>
            <div className="stages__column__title">Післяпродажна підтримка</div>
            <div className="stages__column__text">
              Наша команда залишиться з вами після укладання угоди, готовою надати підтримку та відповісти на всі ваші
              запитання, що виникають після купівлі ділянки.
            </div>
          </div>
          <div className="stages__column__button__container">
            <div className="stages__column__button__text">
              Виникли питання
              <br /> щодо етапів
              <br /> співапраці?
            </div>
            <div className="stages__column__button button" onClick={scrollToContact}>
              <svg
                className="button__icon"
                width="65"
                height="65"
                viewBox="0 0 65 65"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M59.5832 46.0476C59.5805 53.8229 54.1167 60.3216 46.8193 61.9168L45.0914 56.733C48.3523 56.2009 51.1237 54.2129 52.7173 51.4583H46.0415C43.0499 51.4583 40.6248 49.0333 40.6248 46.0416V35.2083C40.6248 32.2167 43.0499 29.7916 46.0415 29.7916H53.9989C52.6661 19.1037 43.5488 10.8333 32.4998 10.8333C21.4509 10.8333 12.3336 19.1037 11.0008 29.7916H18.9582C21.9497 29.7916 24.3748 32.2167 24.3748 35.2083V46.0416C24.3748 49.0333 21.9497 51.4583 18.9582 51.4583H10.8332C7.84163 51.4583 5.4165 49.0333 5.4165 46.0416V32.5C5.4165 17.5422 17.5421 5.41663 32.4998 5.41663C47.4574 5.41663 59.5832 17.5422 59.5832 32.5V35.2048V35.2083V46.0416V46.0476Z"
                  fill="white"
                />
              </svg>
              Зв'язатись з<br /> нами
            </div>
          </div>
        </div>
      </Container>
    </section>
  );
};
